function generateSongText() {
  for (let i = 1; i < 100; i++) {
    let num = 100;
    num -= i;
    if (num > 10 && num < 21) {
      console.log(`${num} бутылок пива на стене, ${num} бутылок пива!
Возьми одну, пусти по кругу, ${num - 1} бутылок пива на стене!`);
    } else if (num % 10 > 4 || num % 10 === 0) {
      console.log(`${num} бутылок пива на стене, ${num} бутылок пива!
Возьми одну, пусти по кругу, ${num - 1} ${
        (num - 1) % 10 > 4 ? "бутылок" : "бутылки"
      } пива на стене!`);
    } else if (num % 10 > 1 && num % 10 < 5) {
      console.log(`${num} бутылки пива на стене, ${num} бутылки пива!
Возьми одну, пусти по кругу, ${num - 1} ${
        (num - 1) % 10 > 1 ? "бутылки" : "бутылка"
      } пива на стене!`);
    } else if (num % 10 === 1) {
      console.log(`${num} бутылка пива на стене, ${num} бутылка пива!
Возьми одну, пусти по кругу, ${num - 1} бутылок пива на стене!`);
    }
  }
}

generateSongText();
